OpenDTEF-v2012/tutorials/DNS/dnsFoam/boxTurb16/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication boxTurb
runApplication $(getApplication)
runApplication -s enstrophy  postProcess -func enstrophy

#------------------------------------------------------------------------------
